# 파이썬은 인간다운 언어이다.
# 파이썬은 문법이 쉬워 빠르게 배울 수 있다
# 대신 시스템 프로그래밍이나 하드웨어 제어와 같은 복잡한 작업은 파이썬과 어울리지 않지만 대신 이러한 작업들은 다른 언어로 작성한 뒤 파이썬에 포함시킬 수 있다.
# 예를 들어 C와 같은 언어
# 파이썬은 가장 좋은 방법 1가지만 사용하는 것을 선호하게 만들어졌다. 여러가지 방법보다는 훨씬 배우기 쉽다.
# 파이썬은 들여쓰기를 제대로 하지 않으면 코드가 실행되지 않는다.
# 파이썬으로 할 수 있는 일
# 1. 시스템 유틸리티 제작 : 운영체제들의 시스템 명령어를 사용할 수 있는 각종 도구를 갖추고 있기 때문에 이를 바탕으로 갖가지 시스템 유틸리티를 만드는 데 유리하다.
# 2. GUI : GUI 프로그래밍을 위한 도구들이 잘 갖추어져 있어 GUI 프로그램을 만들기 쉽다.
# 3. C/C++와의 결합 : 파이썬은 접착 언어라고도 부르는데, 예를 들어 C나 C++로 만든 프로그램을 파이썬에서 사용할 수 있고, 파이썬으로 만든 프로그램 또한 C/C++에서 사용할 수 있다.
# 4. 웹 프로그래밍 : 웹 서핑을 하면서 게시판이나 방명록같은 것에 글을 남길 때가 있는데, 파이썬은 이러한 웹 프로그램을 만들기에 매우 유용하다.
# 5. 수치 연산 프로그래밍 : Numpy 수치 연산 모듈을 이용하면 수치 연산 프로그래밍 또한 가능하다.
# 6. 데이터베이스 프로그래밍 : 오라클, 마이에스큐엘, 포스트그레스큐엘 등의 데이터베이스에 접근하기 위한 도구를 제공하므로 데이터베이스 프로그래밍 또한 가능하다.
# 7. 데이터 분석 : 판다스 모듈을 사용하면 데이터 분석을 더 쉽고 효과적으로 할 수 있다.
# 8. 사물 인터넷 : 라즈베리파이를 제어하는 도구로써 파이썬을 사용할 수 있다. 이를 이용하면 라즈베리파이에 연결된 모터를 작동시키거나 LED에 불이 들어오게 하는 등의 직접적인 제어를 할 수 있다.
# 파이썬으로 하기 힘든 일
# 1. 시스템과 밀접함 프로그래밍 영역 : 인터프리터 언어로써 한줄한줄씩 실행되는 구조이기 때문에 속도가 느린 편
# 2. 모바일 프로그래밍


#아래의 코드는 만약 5가 있으면 '5가 있습니다'를 출력하고 없으면 '5가 없습니다'를 출력해주세요라는 뜻이다.
# if 5 in [1, 2, 3, 4] : 
#   print('5가 있습니다.')
# else :
#   print('5가 없습니다.')

